[
    {
      "id" : 1001,
      "name" : "Tenet",
      "genre" : "Action",
      "year" : "2020",
      "rating" : 70,
      "isFavorite" : true,
      "isFeatured" : false,
      "category" : "Recently Added",
      "description" : "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
      "imageName" : "tenet"
    },
    {
      "id" : 1002,
      "name" : "Wonder Woman 1984",
      "genre" : "Action",
      "year" : "2020",
      "rating" : 60,
      "isFavorite" : true,
      "isFeatured" : true,
      "category" : "Recently Added",
      "description" : "Wonder Woman comes into conflict with the Soviet Union during the Cold War in the 1980s and finds a formidable foe by the name of the Cheetah.",
      "imageName" : "wonderwoman1984"
    },
    {
      "id" : 1003,
      "name" : "Skylines",
      "genre" : "Action",
      "year" : "2020",
      "rating" : 58,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Recently Added",
      "description" : "When a virus threatens to turn the now earth-dwelling friendly alien hybrids against humans, Captain Rose Corley must lead a team of elite mercenaries on a mission to the alien world in order to save what's left of humanity.\n",
      "imageName" : "skylines"
    },
    {
      "id" : 1004,
      "name" : "Synchronic",
      "genre" : "Action",
      "year" : "2020",
      "rating" : 86,
      "isFavorite" : true,
      "isFeatured" : false,
      "category" : "Recently Added",
      "description" : "Two New Orleans paramedics' lives are ripped apart after encountering a series of horrific deaths linked to a designer drug with bizarre, otherworldly effects.",
      "imageName" : "synchronic"
    },
    {
      "id" : 1005,
      "name" : "Fatale",
      "genre" : "Thriller",
      "year" : "2020",
      "rating" : 64,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Recently Added",
      "description" : "A married man is tricked into a murder scheme by a female police detective.",
      "imageName" : "fatale"
    },
    {
      "id" : 1006,
      "name" : "Ava",
      "genre" : "Action",
      "year" : "2020",
      "rating" : 56,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Recently Added",
      "description" : "A black ops assassin is forced to fight for her own survival after a job goes dangerously wrong.",
      "imageName" : "ava"
    },
    {
      "id" : 1007,
      "name" : "Parasite",
      "genre" : "Thriller",
      "year" : "2019",
      "rating" : 85,
      "isFavorite" : true,
      "isFeatured" : false,
      "category" : "Top Rated",
      "description" : "All unemployed, Ki-taek's family takes peculiar interest in the wealthy and glamorous Parks for their livelihood until they get entangled in an unexpected incident.",
      "imageName" : "parasite"
    },
    {
      "id" : 1008,
      "name" : "Pulp Fiction",
      "genre" : "Thriller",
      "year" : "1994",
      "rating" : 95,
      "isFavorite" : true,
      "isFeatured" : false,
      "category" : "Top Rated",
      "description" : "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
      "imageName" : "pulpfiction"
    },
    {
      "id" : 1009,
      "name" : "The Dark Knight",
      "genre" : "Action",
      "year" : "2008",
      "rating" : 85,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Top Rated",
      "description" : "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
      "imageName" : "thedarkknight"
    },
    {
      "id" : 1010,
      "name" : "Hamilton",
      "genre" : "Musical",
      "year" : "2020",
      "rating" : 85,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Top Rated",
      "description" : "Presenting the tale of American founding father Alexander Hamilton, this filmed version of the original Broadway smash hit is the story of America then, told by America now.",
      "imageName" : "hamilton"
    },
    {
      "id" : 1011,
      "name" : "Interstellar",
      "genre" : "Adventure",
      "year" : "2014",
      "rating" : 83,
      "isFavorite" : true,
      "isFeatured" : false,
      "category" : "Top Rated",
      "description" : "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
      "imageName" : "interstellar"
    },
    {
      "id" : 1012,
      "name" : "Inception",
      "genre" : "Action",
      "year" : "2010",
      "rating" : 83,
      "isFavorite" : true,
      "isFeatured" : false,
      "category" : "Top Rated",
      "description" : "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
      "imageName" : "inception"
    },
    {
      "id" : 1013,
      "name" : "Soul",
      "genre" : "Animated",
      "year" : "2020",
      "rating" : 83,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Top Rated",
      "description" : "Joe Gardner is a middle school teacher with a love for jazz music. After a successful gig at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.",
      "imageName" : "soul"
    },
    {
      "id" : 1014,
      "name" : "American Dream",
      "genre" : "Action",
      "year" : "2021",
      "rating" : 0,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Upcoming",
      "description" : "Two American entrepreneurs must face a Russian mobster's vengeance after they cut him out of a business deal.",
      "imageName" : "americandream"
    },
    {
      "id" : 1015,
      "name" : "Jumanji: Level One",
      "genre" : "Adventure",
      "year" : "2021",
      "rating" : 0,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Upcoming",
      "description" : "Set in 1869, two children receive a mysterious game after their father goes missing in the jungles of Africa. They unravel both the secret of their father’s disappearance and the origin of Jumanji. See how it all began.",
      "imageName" : "jumanjilevelone"
    },
    {
      "id" : 1016,
      "name" : "The Little Things",
      "genre" : "Thriller",
      "year" : "2021",
      "rating" : 0,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Upcoming",
      "description" : "Deke, a burnt-out Kern County, CA deputy sheriff teams with Baxter, a crack LASD detective, to nab a serial killer. Deke's nose for the \"little things\" proves eerily accurate, but his willingness to circumvent the rules embroils Baxter in a soul-shattering dilemma. Meanwhile, Deke must wrestle with a dark secret from his past.",
      "imageName" : "thelittlethings"
    },
    {
      "id" : 1017,
      "name" : "No Time to Die",
      "genre" : "Action",
      "year" : "2021",
      "rating" : 0,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Upcoming",
      "description" : "Bond has left active service and is enjoying a tranquil life in Jamaica. His peace is short-lived when his old friend Felix Leiter from the CIA turns up asking for help. The mission to rescue a kidnapped scientist turns out to be far more treacherous than expected, leading Bond onto the trail of a mysterious villain armed with dangerous new technology.",
      "imageName" : "notimetodie"
    },
    {
      "id" : 1018,
      "name" : "Godzilla vs. Kong",
      "genre" : "Action",
      "year" : "2021",
      "rating" : 0,
      "isFavorite" : false,
      "isFeatured" : false,
      "category" : "Upcoming",
      "description" : "Legends collide as Godzilla and Kong, the two most powerful forces of nature, clash in a spectacular battle for the ages! The monster war rages on the surface and deep within our world as the spectacular secret realm of the titans known as the hollow earth is revealed.",
      "imageName" : "godzillavskong"
    }
]
